function code = codeGene_pilot(PRN)
% 生成北斗B1C信号导频分量主码,反逻辑
% 码长10230
% 在Weil码的某一位置循环截取,参数p确定,Weil码长10230
% Weil码由legendre序列生成,legendre序列一定,生成方式由参数w确定,w取值范围1~5121
% 参考《空间信号接口控制文件B1C 1.0》

% w参数表
wlist = [796,156,4198,3941,1374,1338,1833,2521,3175,168,...
         2715,4408,3160,2796,459,3594,4813,586,1428,2371, ...
         2285,3377,4965,3779,4547,1646,1430,607,2118,4709, ...
         1149,3283,2473,1006,3670,1817,771,2173,740,1433, ...
         2458,3459,2155,1205,413,874,2463,1106,1590,3873, ...
         4026,4272,3556,128,1200,130,4494,1871,3073,4386, ...
         4098,1923,1176];

% p参数表
plist = [7575,2369,5688,539,2270,7306,6457,6254,5644,7119, ...
         1402,5557,5764,1073,7001,5910,10060,2710,1546,6887, ...
         1883,5613,5062,1038,10170,6484,1718,2535,1158,526, ...
         7331,5844,6423,6968,1280,1838,1989,6468,2091,1581, ...
         1453,6252,7122,7711,7216,2113,1095,1628,1713,6102, ...
         6123,6070,1115,8047,6795,2575,53,1729,6388,682, ...
         5565,7160,2277];

% 根据卫星编号选取w,p的值
w = wlist(PRN);
p = plist(PRN);

% legendre序列,-1表示逻辑1,1表示逻辑0
N = 10243;
L = ones(1,N); %全0逻辑
for x=0:N-1 %为1逻辑赋值
    k = mod(x*x,N);
    L(k+1) = -1;
end
L(1) = 1; %第一个为逻辑0

% Weil码序列
W = zeros(1,N);
for k=0:N-1
    W(k+1) = L(k+1) * L(mod(k+w,N)+1);
end

% 伪随机码
code = zeros(1,10230);
for n=0:10229
    code(n+1) = W(mod(n+p-1,N)+1);
end

% 显示头24个码片和尾24个码片(八进制)
% first = code(1:24)==-1; %01数组
% first = dec2bin(first)'; %二进制字符串
% first = bin2dec(first); %十进制数
% first = dec2base(first, 8); %八进制字符串
% disp(first)
% last = code(end-23:end)==-1; %01数组
% last = dec2bin(last)'; %二进制字符串
% last = bin2dec(last); %十进制数
% last = dec2base(last, 8); %八进制字符串
% disp(last)

end