% 大加速度,50g/s,50g
syms t

%% 水平速度
VhFun = [];
VhFun{1,1} = [0,30];     VhFun{1,2} = 0;
VhFun{2,1} = [30,31];    VhFun{2,2} = 0.5*500*(t-30)^2;
VhFun{3,1} = [31,39];    VhFun{3,2} = 250+500*(t-31);
VhFun{4,1} = [39,40];    VhFun{4,2} = 4250+500*(t-39)-0.5*500*(t-39)^2;
VhFun{5,1} = [40,45];    VhFun{5,2} = 4500;
VhFun{6,1} = [45,46];    VhFun{6,2} = 4500-0.5*500*(t-45)^2;
VhFun{7,1} = [46,54];    VhFun{7,2} = 4250-500*(t-46);
VhFun{8,1} = [54,55];    VhFun{8,2} = 250-500*(t-54)+0.5*500*(t-54)^2;
VhFun{9,1} = 55;         VhFun{9,2} = 0;

% VhFun = [];
% VhFun{1,1} = [0,30];     VhFun{1,2} = 0;
% VhFun{2,1} = [30,31];    VhFun{2,2} = 0;
% VhFun{3,1} = [31,39];    VhFun{3,2} = 500*(t-31);
% VhFun{4,1} = [39,40];    VhFun{4,2} = 4000;
% VhFun{5,1} = [40,45];    VhFun{5,2} = 4000;
% VhFun{6,1} = [45,46];    VhFun{6,2} = 4000;
% VhFun{7,1} = [46,54];    VhFun{7,2} = 4000-500*(t-46);
% VhFun{8,1} = [54,55];    VhFun{8,2} = 0;
% VhFun{9,1} = 55;         VhFun{9,2} = 0;

%% 速度方向
VyFun = [];
VyFun{1,1} = 0;          VyFun{1,2} = 90;

%% 天向速度
VuFun = [];
VuFun{1,1} = 0;          VuFun{1,2} = 0;

%% 航向角
AyFun = [];
AyFun{1,1} = 0;          AyFun{1,2} = 90;

%% 俯仰角
ApFun = [];
ApFun{1,1} = 0;          ApFun{1,2} = 0;

%% 滚转角
ArFun = [];
ArFun{1,1} = 0;          ArFun{1,2} = 0;
