function t = time_carry(t)
% 微秒,毫秒,秒进位
% t:[s,ms,us]
% 微秒和毫秒始终在0到1000之间,正数,秒可以为负

while t(3)>=1000
    t(2) = t(2) + 1;
    t(3) = t(3) - 1000;
end
while t(3)<0
    t(2) = t(2) - 1;
    t(3) = t(3) + 1000;
end
while t(2)>=1000
    t(1) = t(1) + 1;
    t(2) = t(2) - 1000;
end
while t(2)<0
    t(1) = t(1) - 1;
    t(2) = t(2) + 1000;
end

% if t(3)>=1000
%     t(2) = t(2) + 1;
%     t(3) = t(3) - 1000;
% elseif t(3)<0
%     t(2) = t(2) - 1;
%     t(3) = t(3) + 1000;
% end
% if t(2)>=1000
%     t(1) = t(1) + 1;
%     t(2) = t(2) - 1000;
% elseif t(2)<0
%     t(1) = t(1) - 1;
%     t(2) = t(2) + 1000;
% end

end